---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.CannotDrawExtrusionRoof
source: html/e6a4fdd0-69c4-15da-ad53-ec14f0a30a1e.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.CannotDrawExtrusionRoof Property

Can't make extruded roof.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotDrawExtrusionRoof { get; }
```